using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace TasksCsharp.CSharp.pro
{
    internal class _I
    {
        public static void I1()
        {
            ////I1.1.Рассчитать значение у при заданном значении х:
            ////y = sin(x) при x> 0 или y = cos(x) в противном случае.
            
            
            //Console.WriteLine("Please, enter x:");
            //double x = double.Parse(Console.ReadLine());

            //if (x == 0 )
            //{
            //    Console.WriteLine("x should be not equal 0");

            //}
            //else if (x > 0)
            //{
            //    double y = Math.Round(Math.Sin(x)); 
            //    Console.WriteLine($"The result is: y = {y} ");
            //}
            //else
            //{
            //    double y = Math.Round(Math.Cos(x));
            //    Console.WriteLine($"The result is: y = {y} ");
            //}


            ////I1.2.Даны два различных вещественных числа. Определить:
            ////а) какое из них больше;
            ////б) какое из них меньше.
            ///
            //Console.WriteLine("Please, enter numer1: ");
            //double number1 = double.Parse(Console.ReadLine());
            //Console.WriteLine("Please, enter numer2: ");
            //double number2 = double.Parse(Console.ReadLine());

            //if (number1 == 0 || number2 == 0)
            //{
            //    Console.WriteLine($"Number's should not be equal to 0");
            //}
            //else if (number1 > number2)
            //{
            //    Console.WriteLine($"The number {number1} is greater than {number2}");
            //}
            //else
            //{
            //    Console.WriteLine($"The number {number2} is greater than {number1}");
            //}

            ////I1.3.Определить максимальное и минимальное значения из двух различных вещественных чисел.

            ////I1.4.Известны два расстояния: одно в километрах, другое — в футах(1 фут 0,305 м). Какое из расстояний меньше?

            ////I1.5.Известны две скорости: одна в километрах в час, другая — в метрах в секунду. Какая из скоростей больше?

            ////I1.6.Даны радиус круга и сторона квадрата.У какой фигуры площадь больше?

            ////I1.7.Даны объемы и массы двух тел из разных материалов. Материал какого из тел имеет большую плотность?

            ////I1.8.Известны сопротивления двух не соединенных друг с другом участков электрической цепи и напряжение на каждом из них. По какому участку протекает меньший ток?

            ////I1.9.Даны вещественные числа a, b, c(a не равно 0).Выяснить, имеет ли уравнение ax2 +bx + c = 0 вещественные корни.

            ////I1.10.Для условий предыдущей задачи в случае наличия вещественных корней найти их, в противном случае — вывести на экран соответствующее сообщение.Вариант равенства корней отдельно не рассматривать.

            ////I1.11.Известны год и номер месяца рождения человека, а также год и номер месяца сегодняшнего дня(январь — 1 и т.д.).Определить возраст человека(число полных лет). В случае совпадения указанных номеров месяцев считать, что прошел полный год.

            ////I1.12.Известны площади круга и квадрата. Определить:    
            ////а) уместится ли круг в квадрате?
            ////б) уместится ли квадрат в круге?

            ////I1.13.Известны площади круга и равностороннего треугольника.Определить:
            ////а) уместится ли круг в треугольнике?
            ////б) уместится ли треугольник в круге?

            ////I1.14.Даны два прямоугольника, стороны которых параллельны или перпендикулярны осям координат. Известны координаты левого нижнего и правого верхнего углов каждого из них.Найти координаты левого нижнего и правого верхнего углов минимального прямоугольника, содержащего указанные прямоугольники.

            ////I1.15.Даны два прямоугольника, стороны которых параллельны или перпендикулярны осям координат. Известны координаты левого нижнего угла каждого из них и длины их сторон. Найти координаты левого нижнего и правого верхнего углов минимального прямоугольника, содержащего указанные прямоугольники.
        }
    }
}
