using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace TasksCsharp.CSharp.pro
{
    internal class _S
    {
        public static void S1()
        {
            ////S1.1. Вывести на экран число  с точностью до сотых.

                //double number = 12.4558788;
                //Console.WriteLine(Math.Round(number,2));// the result is 12.45

            ////S1.2. Вывести на экран число e (основание натурального логарифма) с точностью до десятых.

                //double e = 2.71828182845904;
                //Console.WriteLine(Math.Round(e,1)); // the result is 2.7

            ////S1.3. Составить программу вывода на экран числа, вводимого с клавиатуры.Выводимому числу должно предшествовать сообщение «Вы ввели число».

                //Console.WriteLine("Please, enter any number");
                //double input = double.Parse(Console.ReadLine());
                //Console.WriteLine($"You entered the number: {input}");

            ////S1.4. Составить программу вывода на экран числа, вводимого с клавиатуры.После выводимого числа должно следовать сообщение » — вот какое число Вы  ввели».

                //Console.WriteLine("Please, enter any number");
                //double input = double.Parse(Console.ReadLine());
                //Console.WriteLine($"{input} - the number you have entered ");

            ////S1.5. Вывести на одной строке числа 1, 13 и 49 с одним пробелом между ними.

            ////S1.6. Вывести на одной строке числа 7, 15 и 100 с двумя пробелами между ними.

            ////S1.7. Составить программу вывода на экран в одну строку трех любых чисел с двумя пробелами между ними.

            ////S1.8. Составить программу вывода на экран в одну строку четырех любых чисел с одним пробелом между ними.

            ////S1.9. Вывести на экран числа 50 и 10 одно под другим.

            ////S1.10. Вывести на экран числа 5, 10 и 21 одно под другим.

            ////S1.11. Составить программу вывода на экран «столбиком» четырех любых чисел.

            ////S1.12. Составить программу вывода на экран следующей информации:
            ////5 10
            ////7 см

            ////S1.13. Составить программу вывода на экран следующей информации:
            ////2 кг
            ////13 17
        }
    }
}
