using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace TasksCsharp.CSharp.pro
{
    internal class _W
    {
        public static void W1()
        {

            ////W1.1.Дана непустая последовательность целых чисел, оканчивающаяся нулем.Найти:
            ////а) сумму всех чисел последовательности;
            ////б) количество всех чисел последовательности.
            //Console.WriteLine("Please, enter the sequence numbers, in the end should be 0");
            //double sequence = Console.ReadLine();
            //if (!(sequence % 10 == 0))
            //{

            //}


            ////W1.2.Дана непустая последовательность неотрицательных целых чисел, оканчивающаяся отрицательным числом.Найти среднее арифметическое всех чисел последовательности(без учета отрицательного числа).

            ////W1.3.Дана последовательность из n вещественных чисел.Первое число в последовательности нечетное.Найти сумму всех идущих подряд в начале последовательности нечетных чисел. Условный оператор не использовать.

            ////W1.4.Дана последовательность из n вещественных чисел, начинающаяся с отрицательного числа. Определить, какое количество отрицательных чисел записано в начале последовательности. Условный оператор не использовать.

            ////W1.5.Дана последовательность целых чисел a1, a2, …, a30, в начале которой записано несколько равных между собой элементов. Определить количество таких элементов последовательности.Условный оператор не использовать.

            ////W1.6.Дана последовательность вещественных чисел a1, a2, …, a40, упорядоченная по возрастанию, и число n, не равное ни одному из чисел последовательности и такое, что a1 < n < a40.
            ////а) Определить сумму чисел последовательности, меньших n.
            ////б) Найти два элемента последовательности(их порядковые номера и значение) в интервале, между которыми находится значение n.
            ////Примечание.В обеих задачах условный оператор не использовать.

            ////W1.7.Дана непустая последовательность положительных целых чисел a1, a2, …, оканчивающаяся нулем.Получить a1, a1 · a2, a1 · a2 · a3, …, 0.

            ////W1.8.Дано число n. Из чисел 1, 4, 9, 16, 25, … напечатать те, которые не превышают n.

            ////W1.9.Среди чисел 1, 4, 9, 16, 25, … найти первое число, большее n.

            ////W1.10.Дано число n.
            ////а) Напечатать те натуральные числа, квадрат которых не превышает n.
            ////б) Найти первое натуральное число, квадрат которого больше n.

            ////W1.11.Дано число а(1 < а <= 1,5). Из чисел 1 + 1 / 2 , 1 + 1 / 3 , … напечатать те, которые не меньше а.

            ////W1.12.Дано число а(1 < а <= 1,5). Среди чисел 1 + 1 / 2 , 1 + 1 / 3 , … найти первое, меньшее а.

            ////W1.13.Рассмотрим последовательность чисел: 1 + 1 / 2, 1 + 1 / 3, … , 1 + 1 / n.Напечатать все значения n, при которых все числа последовательности будут не меньше а(1 < а <= 1, 5).

            ////W1.14.Дано число а(1 < а <= 1.5). Найти такое наименьшее n, что в последовательности чисел 1 + 1 / 2 , 1 + 1 / 3 , …, 1 + 1 / n последнее число будет меньше а.

            ////W1.15.Даны вещественные числа а и b(1 < a < 1.5, 1 < b < 1.5, a < b).Из чисел 1, 1 + 1 / 2 , 1 + 1 / 3 , …, напечатать те числа c, для которых выполняется условие а<c < b.

            ////W1.16.Среди чисел 1, 1 + 1 / 2 , 1 + 1 / 2 + 1 / 3 , … найти первое, большее числа a, причем 4 < a < 6.

            ////W1.17.Дано вещественное число а(2 < a < 5).Напечатать все значения n, при которых(1 + 1 / 2 + 1 / 3 + … +1 / n) < a.

            ////W1.18.Дано вещественное число а(9 < a < 10).Найти такое наименьшее n, что 1 + 1 / 2 + 1 / 3 +…+1 / n > a.

            ////W1.19.Рассмотрим последовательность, образованную дробями: 1 / 1, 2 / 1, 3 / 2, …, в которой числитель(знаменатель) следующего члена последовательности получается сложением числителей(знаменателей) двух предыдущих членов.Числители двух первых дробей равны 1 и 2, знаменатели — 1 и 1.Найти первый член такой последовательности, который отличается от предыдущего члена не более чем на 0,001.

            ////W1.20.Последовательность Фибоначчи образуется так: первый и второй члены последовательности равны 1, каждый следующий равен сумме двух предыдущих(1, 1, 2, 3, 5, 8, 13, …). Найти:
            ////а) первое число в последовательности Фибоначчи, большее n(значение n вводится с клавиатуры; n > 1);
            ////б) сумму всех чисел в последовательности Фибоначчи, которые не превосходят 1000.

        }
    }
}
